app/Models/ModelPendidikan.php

SELECT *
FROM `tbl_pendidikan`
---
    public function AllData()
    {
        return $this->db->table('tbl_pendidikan')
        ->get()->getResultArray();

INSERT INTO `tbl_pendidikan` (`pendidikan`) VALUES ('b')
---
    public function InsertData($data)
    {
        $this->db->table('tbl_pendidikan')->insert($data);